# Lesson 10 Activity: Working with Pandas

## Learning Objectives

By the end of this activity, you will be able to:
- Create Pandas Series and DataFrames
- Load data from CSV files
- Perform basic data exploration and analysis
- Calculate descriptive statistics
- Filter and manipulate DataFrame data

## Tips

- **Creating DataFrames:** Use `pd.DataFrame(dictionary)` where dictionary keys become column names
- **Loading CSV files:** Use `pd.read_csv('filename.csv')`
- **Basic exploration:** Use `.head()`, `.tail()`, `.info()`, `.describe()`, and `.shape`
- **Filtering data:** Use conditions like `df[df['column'] > value]`
- **Column selection:** Use `df['column_name']` or `df[['col1', 'col2']]`
- **Adding columns:** Use `df['new_column'] = calculation`
- **Statistics:** Use `.mean()`, `.max()`, `.min()`, `.sum()` methods

**Remember:** Take your time with each step and test your code frequently!

In [2]:
import pandas as pd
import numpy as np

---
## Problem 1: Creating Your First DataFrame

**Scenario:** You're working at a bookstore and need to create a simple inventory system.

**Your Task:**
1. Create a DataFrame called `books_df` with the following data:
   - Book titles: ["Python Basics", "Data Science Handbook", "Web Development Guide"]
   - Authors: ["John Smith", "Jane Doe", "Mike Johnson"]
   - Prices: [29.99, 45.50, 35.00]
   - Stock: [15, 8, 12]

2. Display the DataFrame
3. Print the shape of the DataFrame
4. Display basic information about the DataFrame using `.info()`

In [4]:
# Step 1: Create the DataFrame
df = pd.DataFrame({"Book titles": ["Python Basics", "Data Science Handbook", "Web Development Guide"],
   "Authors": ["John Smith", "Jane Doe", "Mike Johnson"],
   "Prices": [29.99, 45.50, 35.00],
   "Stock": [15, 8, 12]})

In [5]:
# Step 2: Display the DataFrame
df

             Book titles       Authors  Prices  Stock
0          Python Basics    John Smith   29.99     15
1  Data Science Handbook      Jane Doe   45.50      8
2  Web Development Guide  Mike Johnson   35.00     12

In [6]:
# Step 3: Print the shape
df.shape

(3, 4)

In [27]:
# Step 4: Display info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Book titles  3 non-null      object
 1   Authors      3 non-null      object
 2   Prices       3 non-null      float64
 3   Stock        3 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 228.0+ bytes

---
## Problem 2: Loading and Exploring Student Data

**Scenario:** You're a teacher analyzing student performance data.

**Your Task:**
1. Load the `students.csv` file into a DataFrame called `students_df`
2. Display the first 3 rows using `.head()`
3. Display the last 2 rows using `.tail()`
4. Show descriptive statistics for numerical columns using `.describe()`
5. Find the average grade of all students

In [261]:
# Step 1: Load the CSV file
students_df = pd.read_csv("students.csv")
students_df

      name  age  grade  subject
0    Alice   20     85     Math
1      Bob   19     92  Science
2  Charlie   21     78     Math
3    Diana   20     88  Science
4      Eva   19     95     Math
5    Frank   22     82  Science
6    Grace   20     90     Math
7    Henry   21     87  Science

In [262]:
# Step 2: Display first 3 rows
students_df.head(3)

      name  age  grade  subject
0    Alice   20     85     Math
1      Bob   19     92  Science
2  Charlie   21     78     Math

In [263]:
# Step 3: Display last 2 rows
students_df.tail(2)

    name  age  grade  subject
6  Grace   20     90     Math
7  Henry   21     87  Science

In [264]:
# Step 4: Show descriptive statistics
students_df.describe()

             age      grade
count   8.000000   8.000000
mean   20.250000  87.125000
std     1.035098   5.462535
min    19.000000  78.000000
25%    19.750000  84.250000
50%    20.000000  87.500000
75%    21.000000  90.500000
max    22.000000  95.000000

In [265]:
# Step 5: Calculate average grade
print (students_df['grade'].mean())

87.125

---
## Problem 3: Data Filtering and Selection

**Scenario:** Continue working with the student data to find specific information.

**Your Task:**
1. Display only the 'name' and 'grade' columns from `students_df`
2. Find all students who scored above 85
3. Find all students studying 'Math'
4. Find the highest grade in the dataset
5. Count how many students are in each subject

In [266]:
# Step 1: Display only name and grade columns
students_df[["name", "grade"]]

      name  grade
0    Alice     85
1      Bob     92
2  Charlie     78
3    Diana     88
4      Eva     95
5    Frank     82
6    Grace     90
7    Henry     87

In [267]:
# Step 2: Students with grades above 85
students_df[students_df["grade"] > 85]

    name  age  grade  subject
1    Bob   19     92  Science
3  Diana   20     88  Science
4    Eva   19     95     Math
6  Grace   20     90     Math
7  Henry   21     87  Science

In [268]:
# Step 3: Students studying Math
students_df[students_df["subject"] == "Math"]

      name  age  grade subject
0    Alice   20     85    Math
2  Charlie   21     78    Math
4      Eva   19     95    Math
6    Grace   20     90    Math

In [269]:
# Step 4: Highest grade
students_df[students_df["grade"] == students_df["grade"].max()]

  name  age  grade subject
4  Eva   19     95    Math

In [270]:
# Step 5: Count students by subject
print(students_df["subject"].value_counts())

subject
Math       4
Science    4
Name: count, dtype: int64

---
## Problem 4: Sales Data Analysis

**Scenario:** You're analyzing sales data for an electronics store.

**Your Task:**
1. Load the `sales.csv` file into a DataFrame called `sales_df`
2. Calculate the total value for each product (price × quantity)
3. Add this as a new column called 'total_value' to the DataFrame
4. Find the product with the highest total value
5. Calculate the grand total of all sales

In [374]:
# Step 1: Load the sales data
sales_df = pd.read_csv("sales.csv")
sales_df
print(type(sales_df["price"]))

<class 'pandas.core.series.Series'>

In [ ]:
# Step 2 & 3: Calculate total value and add as new column
def calc_total(col_price, col_quantity):
    return col_price * col_quantity
sales_df["total"] = calc_total(sales_df["price"], sales_df["quantity"])

sales_df

      product   price  quantity        date    Total
0      Laptop  999.99         5  2024-01-15  4999.95
1       Mouse   25.50        20  2024-01-15   510.00
2    Keyboard   75.00        15  2024-01-16  1125.00
3     Monitor  299.99         8  2024-01-16  2399.92
4  Headphones   59.99        12  2024-01-17   719.88

In [ ]:
# Step 4: Find product with highest total value
sales_df[sales_df["total"] == sales_df["total"].max()]

  product   price  quantity        date    Total
0  Laptop  999.99         5  2024-01-15  4999.95

In [ ]:
# Step 5: Calculate grand total of all sales

# Basic, no precision
sales_df["total"].sum()

# As a DataFrame w/ precision
with pd.option_context("display.precision", 2):
    print(pd.DataFrame(sales_df["total"]).sum())

# or as a Series w/ precision
print(np.around(sales_df["total"].sum(), 2))

Total    9754.75
dtype: float64
9754.75

---
## Problem 5: Series Creation and Manipulation

**Scenario:** Create and work with Pandas Series for daily temperature data.

**Your Task:**
1. Create a Pandas Series called `temperatures` with the following data:
   - Values: [22, 25, 23, 26, 24, 27, 25]
   - Index: ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']
2. Find the temperature for Wednesday
3. Find days with temperature above 24 degrees
4. Calculate the average temperature for the week
5. Find the day with the highest temperature

In [378]:
# Step 1: Create the temperature series

values = [22, 25, 23, 26, 24, 27, 25]
n = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']
# temp_series = pd.Series(list(zip(index, values)))
temp_series = pd.Series(values, index=n)

temp_series

Mon    22
Tue    25
Wed    23
Thu    26
Fri    24
Sat    27
Sun    25
dtype: int64

In [379]:
# Step 2: Temperature for Wednesday
print(temp_series["Wed"])

23

In [380]:
# Step 3: Days with temperature above 24
print(temp_series[temp_series > 24])

Tue    25
Thu    26
Sat    27
Sun    25
dtype: int64

In [381]:
# Step 4: Average temperature
print(temp_series.mean())

24.571428571428573

In [382]:
# Step 5: Day with highest temperature
print(temp_series.max())

27

---
## Reflection Questions

Please answer these questions after completing the activity:

1. **What is the difference between a Pandas Series and a DataFrame?**
   
   *Your answer: Series are like lists that can have a defined indexing system and Dataframes are more like dictionary lists. A pd.DataFrame column is a pd.Series

2. **What are the advantages of using Pandas over working with plain Python lists and dictionaries?**
   
   *Your answer: Many built in features, functions, scalability

3. **Describe a real-world scenario where you might use the filtering techniques you learned in Problem 3.**
   
   *Your answer: Looking for dates and times with highest price peaks in stock market trading to find patterns and trends

4. **What did you find most challenging about working with Pandas in this activity?**
   
   *Your answer: Learning the filtering syntax